OdDAI.Session.deleteNPL(OdDAI.List&lt;OdDAI.OdDAIObjectSDAI**&gt;*)
\details
Deletes an instance of Non-Persistent List.

OdDAI.Session.createNPL
\details
Creates an instance of Non-Persistent List.
returns A pointer to non-persistent list.

OdDAI.Session.resetEventCollector(OdSharedPtr&lt;OdDAI.IEventCollector&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets event collector to handle error events in runtime.
\param eventCollector [in] - custom event collector. In case when custom event collector was settled,
the default collector become inactive, that is why error events recording is not working. To restore
default collector and events recording call resetEventCollector without param.

OdDAI.Session.stopEventRecording
\details
Deactivate error events recording mode.

OdDAI.Session.startEventRecording
\details
Activate error events recording mode.

OdDAI.Session.isRecordingOn
\details
Provides information about error logging activity.
\returns Returns true if error events recording mode is on, otherwise returns false.

OdDAI.Session.recordError(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.UInt32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Put error record to error event list.
\param functionID [in] function name.
\param error [in] error id.
\param descpt [in] error description.

OdDAI.Session.errors
\details
Provides error event list.
\returns Returns current list of error events.

OdDAI.Session.deleteRepoRecord(OdSmartPtr&lt;OdDAI.Repository&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Deletes repository record from the session container.
\param repo [in] repository to delete.

OdDAI.Session.closeRepo(OdSmartPtr&lt;OdDAI.Repository&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Closes an opened repository assigned with this session.
\param repo [in] repository to close.

OdDAI.Session.openRepo(OdSmartPtr&lt;OdDAI.Repository&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Opens an unopened repository which exists in the current session.

OdDAI.Session.findRepo(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Finds a repository which exists in the current session.
\param name [in] A name of repository to find.
\returns Returns a smart pointer to the repository if found, and the null if repository
doesn't exist in current session.

OdDAI.Session.createRepoFromFile(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates repository with defined name inside current session and opens a fileName as part of the
newly created repository.
\param fileName [in] A file name to open as part of newly created repository.
\param name [in] A name of repository to create.
\returns Returns a smart pointer to the newly created repository.

OdDAI.Session.createRepo(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates an empty repository with defined name inside current session.
\param name [in] A name of repository to create.
\returns Returns a smart pointer to the newly created repository.

OdDAI.Session.generateRepositoryUniqueName(OdDAI.Session!System.Runtime.CompilerServices.IsConst*,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Tries to find repository with defined name inside current session. Changes and
returns updated name of repository in the case if repository with provided
name already exists in current session.
\param session [in] A pointer to session to find repository with name provided.
\param name [in] A supposed name of repository to create inside a session.
\returns Returns a name of repository which is available to create inside a session.

OdDAI.Session.#ctor
\details
Session class default constructor.

OdDAI.Session
\details
A class that implements functionality for working with session data as repositories,
error logging and non-persistent lists.
\remarks
The single current session instance can be created by calling oddaiCreateSession() function,
it can be deleted only by calling oddaiCloseCurrentSession(). The currently opened session
can be accessed by oddaiSession() function calling.